 DeviceRegistryEvents
| where ActionType == @"RegistryValueSet"
| where RegistryKey == @"HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows Defender\Exclusions\TemporaryPaths"
|project TimeGenerated, DeviceId, DeviceName, RegistryKey, InitiatingProcessAccountName, InitiatingProcessCommandLine
