{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "903a0628-df2f-4a7d-93ac-80fbf48032ec",
            "version": "KqlParameterItem/1.0",
            "name": "InternalWSs",
            "type": 1,
            "isRequired": true,
            "query": "where type =~ \"Microsoft.OperationsManagement/solutions\"\r\n| where name startswith \"SecurityInsights\"\r\n| parse id with * '(' WSName ')' *\r\n| take 1\r\n| project WSName",
            "crossComponentResources": [
              "value::all"
            ],
            "isHiddenWhenLocked": true,
            "timeContext": {
              "durationMs": 2592000000
            },
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "8c7b9fc5-b87f-44d7-9cc8-bec025faf2c2",
            "version": "KqlParameterItem/1.0",
            "name": "DefaultSubscription_Internal",
            "type": 1,
            "isRequired": true,
            "query": "where type =~ 'microsoft.operationalinsights/workspaces'\r\n| take 1\r\n| project subscriptionId",
            "crossComponentResources": [
              "value::selected"
            ],
            "isHiddenWhenLocked": true,
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "f046681a-d502-4370-9a04-736042ed7e47",
            "version": "KqlParameterItem/1.0",
            "name": "Subscription",
            "type": 6,
            "query": "resources\r\n| summarize by subscriptionId\r\n| project value = strcat(\"/subscriptions/\", subscriptionId), label = subscriptionId, selected = iff(subscriptionId =~ '{DefaultSubscription_Internal}', true, false)",
            "crossComponentResources": [
              "value::all"
            ],
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources",
            "value": "/subscriptions/99005f96-e572-4035-b476-836fd9d83d64"
          },
          {
            "id": "ef68dc9e-94e2-47c9-bfc8-8206537418a8",
            "version": "KqlParameterItem/1.0",
            "name": "Workspace",
            "type": 5,
            "query": "//resources\r\n//| where type =~ 'microsoft.operationalinsights/workspaces'\r\n//| project id\r\n\r\nwhere type =~ 'microsoft.operationalinsights/workspaces'\r\n| project value =id, label = name, selected = iff(name =~ '{InternalWSs}', true, false)",
            "crossComponentResources": [
              "{Subscription}"
            ],
            "typeSettings": {
              "showDefault": false
            },
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "f9f6427d-1903-4ebc-9c48-86846ec36119",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange",
            "type": 4,
            "isRequired": true,
            "value": {
              "durationMs": 1209600000
            },
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 900000
                },
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ],
              "allowCustom": true
            },
            "timeContext": {
              "durationMs": 86400000
            }
          },
          {
            "id": "080aebcf-c127-49ea-af49-cdc32888ee08",
            "version": "KqlParameterItem/1.0",
            "name": "DefaultUPNSuffix",
            "type": 1,
            "description": "When extracting the account entity from an alert, if no UPN suffix is included, this suffix will be assumed.",
            "value": "",
            "isHiddenWhenLocked": true
          },
          {
            "id": "19a40f6a-2429-480f-bc34-067b602d1fa8",
            "version": "KqlParameterItem/1.0",
            "name": "AlertID",
            "type": 1,
            "description": "This parameter should be left blank",
            "isHiddenWhenLocked": true
          }
        ],
        "style": "above",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "GlobalParameters"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "// Filter AlertEvidence to relevant source\r\nAlertEvidence\r\n| where ServiceSource == \"Microsoft Data Loss Prevention\"\r\n// Join with EmailAttachmentInfo on NetworkMessageId\r\n| join kind=inner (\r\n    EmailAttachmentInfo\r\n) on $left.NetworkMessageId == $right.NetworkMessageId\r\n// Join with SecurityAlert and extend NetworkMessageId_\r\n| join kind=inner (\r\n    SecurityAlert\r\n    | extend NetworkMessageId_ = tostring(parse_json(Entities)[1].NetworkMessageId)\r\n) on $left.NetworkMessageId == $right.NetworkMessageId_\r\n// Summarize to get the latest record by AlertId\r\n| summarize arg_max(TimeGenerated, Status, SenderFromAddress, RecipientEmailAddress, EmailSubject, FileName1, Title, AccountName, AccountDomain, Severity) by AlertId\r\n//removing DLP Policy so it only shows the policy name\r\n| extend PolicyName = replace(@\"DLP policy \\(.+?\\)\", \"\", Title)\r\n// Project necessary columns for final output with aliases for clarity\r\n| project \r\n    AlertTime = TimeGenerated, \r\n    AlertStatus = Status, \r\n    AlertId, \r\n    Sender = SenderFromAddress, \r\n    AccountName,\r\n    AccountDomain,\r\n    Recipient = RecipientEmailAddress, \r\n    Subject = EmailSubject, \r\n    Attachment = FileName1,\r\n    PolicyName,\r\n    Severity",
        "size": 0,
        "timeContext": {
          "durationMs": 86400000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "query - 3"
    }
  ],
  "fallbackResourceIds": [
    "/subscriptions/99005f96-e572-4035-b476-836fd9d83d64/resourcegroups/cybersoc/providers/microsoft.operationalinsights/workspaces/cybersoc"
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}
