id: 87cc75df-d7b2-44f1-b064-ee924edfc879
name: TI map Domain entity to EmailUrlInfo
description: |
  'Identifies a match in EmailUrlInfo table from any Domain IOC from TI.'
severity: Medium
requiredDataConnectors:
  - connectorId: Office365
    dataTypes:
      - EmailUrlInfo
  - connectorId: ThreatIntelligence
    dataTypes:
      - ThreatIntelligenceIndicator
  - connectorId: ThreatIntelligenceTaxii
    dataTypes:
      - ThreatIntelligenceIndicator
  - connectorId: MicrosoftDefenderThreatIntelligence
    dataTypes:
      - ThreatIntelligenceIndicator
queryFrequency: 1h
queryPeriod: 14d
triggerOperator: gt
triggerThreshold: 0
tactics:
  - InitialAccess
relevantTechniques:
  - T1566
query: |
let dt_lookBack = 1h;
let ioc_lookBack = 14d;
let EmailUrlInfo_ = EmailUrlInfo
    | where isnotempty(Url) or isnotempty(UrlDomain)
    | where TimeGenerated >= ago(dt_lookBack)
    | extend Url = tolower(Url), UrlDomain = tolower(UrlDomain)
    | extend EmailUrlInfo_TimeGenerated = TimeGenerated;
let EmailUrls = EmailUrlInfo_ | distinct Url | summarize make_list(Url);
let EmailUrlDomains = EmailUrlInfo_ | distinct UrlDomain | summarize make_list(UrlDomain);
let EmailEvents_ = EmailEvents
    | where TimeGenerated >= ago(dt_lookBack);
let TI_Urls = ThreatIntelligenceIndicator
    | where TimeGenerated >= ago(ioc_lookBack)
    | where isnotempty(Url)
    | where tolower(Url) in (EmailUrls)
    | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId, Url
    | where Active == true and ExpirationDateTime > now();
let TI_Domains = ThreatIntelligenceIndicator
    | where TimeGenerated >= ago(ioc_lookBack)
    | where isnotempty(DomainName)
    | where tolower(DomainName) in (EmailUrlDomains)
    | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId, DomainName
    | where Active == true and ExpirationDateTime > now();
let TI_Joined_Urls = TI_Urls
    | join kind=innerunique (EmailUrlInfo_) on Url
    | where EmailUrlInfo_TimeGenerated < ExpirationDateTime
    | summarize EmailUrlInfo_TimeGenerated = arg_max(EmailUrlInfo_TimeGenerated, *) by IndicatorId, Url
    | project EmailUrlInfo_TimeGenerated, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore, Url, UrlLocation, NetworkMessageId;
let TI_Joined_Domains = TI_Domains
    | join kind=innerunique (EmailUrlInfo_) on $left.DomainName == $right.UrlDomain
    | where EmailUrlInfo_TimeGenerated < ExpirationDateTime
    | summarize EmailUrlInfo_TimeGenerated = arg_max(EmailUrlInfo_TimeGenerated, *) by IndicatorId, UrlDomain
    | project EmailUrlInfo_TimeGenerated, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore, UrlDomain, UrlLocation, NetworkMessageId;
union TI_Joined_Urls, TI_Joined_Domains
| extend timestamp = EmailUrlInfo_TimeGenerated
| join kind=inner (EmailEvents_) on NetworkMessageId
| where DeliveryAction !has "Blocked"
| extend Name = tostring(split(RecipientEmailAddress, '@', 0)[0]), UPNSuffix = tostring(split(RecipientEmailAddress, '@', 1)[0])
